testFiles/cases/block/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

application simpleFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 100.0;

deltaT 1.0;

writeControl timeStep;

writeInterval 100.0;

purgeWrite 0;

writeFormat ascii;

writePrecision 8;

writeCompression uncompressed;

timeFormat general;

timePrecision 6;

runTimeModifiable yes;
